#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ElettroAle/shared-infrastructure/runs/run-UaFxwEzuPKLRa31r

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster]
module.cluster.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod]
azurerm_dns_zone.zone: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com]
azurerm_dns_a_record.a_record: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.Network/dnsZones/elettroale.com/A/elettroale.com]
module.cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerService/managedClusters/aks-cluster-prod]
module.cluster.azurerm_role_assignment.rbac: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod/providers/Microsoft.Authorization/roleAssignments/ce0c2c16-ff20-4abf-3c49-19b239f1af6a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.azurerm_kubernetes_cluster.aks must be replaced
-/+ resource "azurerm_kubernetes_cluster" "aks" {
      ~ api_server_authorized_ip_ranges     = [] -> (known after apply)
      - azure_policy_enabled                = false -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "cluster-prod-d57322cb.hcp.westeurope.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      ~ http_application_routing_zone_name  = "1d5643da600f4597ae09.westeurope.aksapp.io" -> (known after apply)
      ~ id                                  = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerService/managedClusters/aks-cluster-prod" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.23.12" -> (known after apply)
      - local_account_disabled              = false -> null
        name                                = "aks-cluster-prod"
      ~ node_resource_group                 = "MC_rg-cluster_aks-cluster-prod_westeurope" -> (known after apply)
      - oidc_issuer_enabled                 = false -> null
      + oidc_issuer_url                     = (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "cluster-prod-d57322cb.portal.hcp.westeurope.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      - tags                                = {} -> null
        # (12 unchanged attributes hidden)

      + api_server_access_profile {
          + authorized_ip_ranges     = (known after apply)
          + subnet_id                = (known after apply)
          + vnet_integration_enabled = (known after apply)
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      ~ default_node_pool {
          - custom_ca_trust_enabled      = false -> null
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          ~ kubelet_disk_type            = "OS" -> (known after apply)
          - max_count                    = 0 -> null
          ~ max_pods                     = 110 -> (known after apply)
          - min_count                    = 0 -> null
            name                         = "default"
          ~ node_labels                  = {} -> (known after apply)
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          ~ orchestrator_version         = "1.23.12" -> (known after apply)
          ~ os_sku                       = "Ubuntu" -> (known after apply)
          - tags                         = {} -> null
          + workload_runtime             = (known after apply)
          - zones                        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "1644ad1f-000d-4e1f-96ee-ecb2edb3297a" -> (known after apply)
          ~ tenant_id    = "b736fb4b-186c-4ffe-81c4-5ea638f1ae11" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ kubelet_identity {
          ~ client_id                 = "f5b33700-c1ff-460f-a221-2e0167fa460d" -> (known after apply)
          ~ object_id                 = "966794e4-c30c-4614-a85f-62840a18b9a3" -> (known after apply)
          ~ user_assigned_identity_id = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/MC_rg-cluster_aks-cluster-prod_westeurope/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-cluster-prod-agentpool" -> (known after apply)
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ ip_versions        = [
              - "IPv4",
            ] -> (known after apply)
          ~ load_balancer_sku  = "standard" -> "Standard" # forces replacement
          + network_mode       = (known after apply)
          + network_policy     = (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ pod_cidrs          = [
              - "10.244.0.0/16",
            ] -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs      = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips      = [
                  - "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/MC_rg-cluster_aks-cluster-prod_westeurope/providers/Microsoft.Network/publicIPAddresses/b4bf4a1f-5079-4779-909a-d963ce6cbe2b",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes     = 0 -> 30
              ~ managed_outbound_ip_count   = 1 -> (known after apply)
              ~ managed_outbound_ipv6_count = 0 -> (known after apply)
              ~ outbound_ip_address_ids     = [] -> (known after apply)
              ~ outbound_ip_prefix_ids      = [] -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }
    }

  # module.cluster.azurerm_public_ip.lb-public-ip will be created
  + resource "azurerm_public_ip" "lb-public-ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "pip-cluster-prod"
      + resource_group_name     = "rg-cluster"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.cluster.azurerm_role_assignment.rbac must be replaced
-/+ resource "azurerm_role_assignment" "rbac" {
      ~ id                               = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerRegistry/registries/crclusterprod/providers/Microsoft.Authorization/roleAssignments/ce0c2c16-ff20-4abf-3c49-19b239f1af6a" -> (known after apply)
      ~ name                             = "ce0c2c16-ff20-4abf-3c49-19b239f1af6a" -> (known after apply)
      ~ principal_id                     = "966794e4-c30c-4614-a85f-62840a18b9a3" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ip = [
      - {
          - capacity_reservation_group_id = ""
          - custom_ca_trust_enabled       = false
          - enable_auto_scaling           = false
          - enable_host_encryption        = false
          - enable_node_public_ip         = false
          - fips_enabled                  = false
          - host_group_id                 = ""
          - kubelet_config                = []
          - kubelet_disk_type             = "OS"
          - linux_os_config               = []
          - max_count                     = 0
          - max_pods                      = 110
          - message_of_the_day            = ""
          - min_count                     = 0
          - name                          = "default"
          - node_count                    = 2
          - node_labels                   = {}
          - node_public_ip_prefix_id      = ""
          - node_taints                   = []
          - only_critical_addons_enabled  = false
          - orchestrator_version          = "1.23.12"
          - os_disk_size_gb               = 30
          - os_disk_type                  = "Managed"
          - os_sku                        = "Ubuntu"
          - pod_subnet_id                 = ""
          - proximity_placement_group_id  = ""
          - scale_down_mode               = "Delete"
          - tags                          = {}
          - type                          = "VirtualMachineScaleSets"
          - ultra_ssd_enabled             = false
          - upgrade_settings              = []
          - vm_size                       = "Standard_B2s"
          - vnet_subnet_id                = ""
          - workload_runtime              = ""
          - zones                         = []
        },
    ] -> {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + ddos_protection_plan_id = null
      + domain_name_label       = null
      + edge_zone               = null
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_tags                 = null
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "pip-cluster-prod"
      + public_ip_prefix_id     = null
      + resource_group_name     = "rg-cluster"
      + reverse_fqdn            = null
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = null
      + timeouts                = null
      + zones                   = null
    }

```

</details>

*Pushed by: @ElettroAle, Action: `pull_request`*